/**
 * WebGIS demo示例相关配置参数
 * 包括示例访问时的用户名密码等信息
 * */

//WebGIS 空间信息服务配置
window["WebGIS_Spatial_Server_Config"] = {
    "SpaceQueryTypes": [110,116,120,125,126,128,130,135,137,140,141,142,143,144,150,
                        151,152,153,154,156,157,158,159,160,161,162,163,164,165,180,
                        182,183,190,191,192,193,305,306,310,311,312,320,321,330,
                        331,332,333,334,335,337,338,339,340,342,343,344,345,346,347,
                        349,350,351,352,353,354,356,359,360,361,362,363,364,365,366,
                        367,369,370,371,380,398,399,400,406,410,411,412,420,421,430,
                        431,432,433,434,435,436,437,438,439,440,441,442,443,444,445,
                        446,447,449,450,451,452,453,460,482,484,490,498,499]
}

// //WebGIS 切片数据地址
// window["WebGIS_demo_tiles_url"] = "http://192.168.201.163/";

// //Demo数据文件配置
// window.WebGISDemoData = {
// vectorTileURL="http://192.168.201.163/"
// }

var WebGISDemoDataURL="http://192.168.2.231:2020/webgisapi/";

//配置账号密码
window.WebGISDemoConfig = {
        userName : "bs01",
        password : "Hello123*",
        zoom:12,
        center:[113.12,23.01]
}